app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.name ASC LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "courses".* FROM "courses" ORDER BY courses.name ASC
SELECT "notifications".* FROM "notifications" WHERE "notifications"."course_id" = 1 ORDER BY notifications.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."course_id" = 1
SELECT "coursefiles".* FROM "coursefiles" WHERE "coursefiles"."course_id" = 1 LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "coursefiles" WHERE "coursefiles"."course_id" = 1
---
	def show
		@course=Course.find(params[:id])
		@user=User.find(@course.user_id)
		@notification  = @course.notifications.build(course_id: @course.id)
		 @notifications = @course.notifications.paginate(page: params[:page])
		 @coursefile=@course.coursefiles.build(course_id:@course.id)
		 @coursefiles=@course.coursefiles.paginate(page: params[:page])

INSERT INTO "courses" ("code", "coursecode", "created_at", "description", "lock", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@course = current_user.courses.build(params[:course])

		if @course.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.name ASC LIMIT 1  [["id", "1"]]
SELECT "courses".* FROM "courses" ORDER BY courses.name ASC
---
	def listeners
    @title = "Students"
    @course = Course.find(params[:course_id])
    @users = @course.listeners.paginate(page: params[:page])