app/controllers/coursefiles_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.name ASC LIMIT 1  [["id", "1"]]
INSERT INTO "coursefiles" ("course_id", "created_at", "description", "file_content_type", "file_file_name", "file_file_size", "file_updated_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
    course=Course.find(params[:coursefile][:course_id])
    @coursefile = course.coursefiles.build(params[:coursefile])
    if @coursefile.save