app/controllers/notifications_controller.rb

  def create
    course=Course.find(params[:notification][:course_id])
    @notification = course.notifications.build(params[:notification])
    if @notification.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.name ASC LIMIT 1  [["id", "1"]]
INSERT INTO "notifications" ("content", "course_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "ev notifikacije\r\n"], ["course_id", 1], ["created_at", Wed, 22 May 2013 18:58:43 UTC +00:00], ["updated_at", Wed, 22 May 2013 18:58:43 UTC +00:00], ["user_id", nil]]