app/controllers/relationships_controller.rb

  def create
    @course = Course.find(params[:relationship][:listened_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? ORDER BY courses.name ASC LIMIT 1  [["id", "1"]]