app/controllers/static_pages_controller.rb

  def home
    @profs=User.where(:professor=>true)
---
SELECT "users".* FROM "users" WHERE "users"."professor" = 't'