app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @courses_taking=@user.listened_courses
    @courses_teaching=Course.where(:user_id=>@user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 1 ORDER BY courses.name ASC

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "email", "name", "officehours", "password_digest", "professor", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "officehours" = 'Monday 9-10', "remember_token" = 'ddOLFUZotgYVsRsFX9m40g', "updated_at" = '2013-05-22 18:57:18.648280' WHERE "users"."id" = 1