app/views/layouts/_header.html.erb

SELECT "users".* FROM "users" WHERE "users"."professor" = 't'
---
           <ul class="dropdown-menu">
              <% profs=User.where(:professor=>true) %>

SELECT "courses".* FROM "courses" ORDER BY courses.name ASC
---
            <li class="divider"></li>
              <% courses=Course.all %>